# read design
read_verilog rom.v

# elaborate design hierarchy
hierarchy -check -top rom

# the high-level stuff
proc; tribuf; opt; fsm; opt; memory; opt;

# mapping to internal cell library
# this maps the design circuit to one bit gates, do not use this!!!
# techmap; opt

# cleanup
clean

write_json connections.json